<?php

declare(strict_types=1);

namespace blackJack\Test;

use PHPUnit\Framework\TestCase;
use blackJack\Card;

require_once(__DIR__ . '/../src/Card.php');

final class CardTest extends TestCase
{
    public function testTrumpCards()
    {
        $card = new Card(2);
        $this->assertSame([['ハート' => 1], ['ハート' => 2],['ハート' => 3], ['ハート' => 4], ['ハート' => 5], ['ハート' => 6], ['ハート' => 7], ['ハート' => 8], ['ハート' => 9], ['ハート' => 10], ['ハート' => 'J'], ['ハート' => 'Q'], ['ハート' => 'K'],['スペード' => 1], ['スペード' => 2], ['スペード' => 3], ['スペード' => 4], ['スペード' => 5], ['スペード' => 6], ['スペード' => 7], ['スペード' => 8], ['スペード' => 9], ['スペード' => 10], ['スペード' => 'J'], ['スペード' => 'Q'], ['スペード' => 'K'], ['ダイヤ' => 1], ['ダイヤ' => 2], ['ダイヤ' => 3], ['ダイヤ' => 4], ['ダイヤ' => 5], ['ダイヤ' => 6], ['ダイヤ' => 7], ['ダイヤ' => 8], ['ダイヤ' => 9], ['ダイヤ' => 10], ['ダイヤ' => 'J'], ['ダイヤ' => 'Q'], ['ダイヤ' => 'K'], ['クラブ' => 1], ['クラブ' => 2], ['クラブ' => 3], ['クラブ' => 4], ['クラブ' => 5], ['クラブ' => 6], ['クラブ' => 7], ['クラブ' => 8], ['クラブ' => 9], ['クラブ' => 10], ['クラブ' => 'J'], ['クラブ' => 'Q'], ['クラブ' => 'K']], $card->trumpCards());
    }

    // ToDO:ランダムに生成した時のテストはどうするの？
    // public function testGetCards()
    // {
    //     $card = new Card(2);
    //     $this->assertSame([['ハート' => 1], ['スペード' => 2], ['ダイヤ' => 3], ['クラブ' => 4]], $card->getCards());
    // }
}
